; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	image1 - mode
	image0 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star10 - direction
	GroundStation11 - direction
	Star13 - direction
	Star3 - direction
	Star6 - direction
	Star5 - direction
	GroundStation7 - direction
	Star12 - direction
	Star8 - direction
	Star9 - direction
	Star14 - direction
	GroundStation4 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Star18 - direction
	Planet19 - direction
	Star20 - direction
	Star21 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 Star3)
	(supports instrument1 image1)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 Star12)
	(calibration_target instrument1 GroundStation7)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star14)
	(calibration_target instrument2 Star9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation4)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(pointing satellite1 Star14)
	(have_image Star15 image0)
	(have_image Planet16 image1)
	(have_image Star17 image1)
	(have_image Star18 image1)
	(have_image Planet19 image0)
	(have_image Star20 image1)
	(have_image Star21 image1)
))

)

; plan
1. (turn_to satellite0 star3 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star3)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 star15 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star15)
   goals met: 0 of 8
5. (take_image satellite0 star15 instrument0 image0)
   added: (have_image star15 image0)
   goals met: 1 of 8
6. (turn_to satellite0 planet19 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 planet19)
   goals met: 1 of 8
7. (take_image satellite0 planet19 instrument0 image0)
   added: (have_image planet19 image0)
   goals met: 2 of 8
8. (turn_to satellite0 planet16 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet16)
   goals met: 2 of 8
9. (take_image satellite0 planet16 instrument0 image1)
   added: (have_image planet16 image1)
   goals met: 3 of 8
10. (turn_to satellite0 star17 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star17)
   goals met: 3 of 8
11. (take_image satellite0 star17 instrument0 image1)
   added: (have_image star17 image1)
   goals met: 4 of 8
12. (turn_to satellite0 star18 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star18)
   goals met: 4 of 8
13. (take_image satellite0 star18 instrument0 image1)
   added: (have_image star18 image1)
   goals met: 5 of 8
14. (turn_to satellite0 star20 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star20)
   goals met: 5 of 8
15. (take_image satellite0 star20 instrument0 image1)
   added: (have_image star20 image1)
   goals met: 6 of 8
16. (turn_to satellite0 star21 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star21)
   goals met: 6 of 8
17. (take_image satellite0 star21 instrument0 image1)
   added: (have_image star21 image1)
   goals met: 7 of 8
18. (turn_to satellite1 star14 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star14)
   goals met: 8 of 8
